---
kind: type
id: T:Autodesk.Revit.DB.SaveAsOptions
source: html/f8eecf56-8b25-4140-d66e-c87f0d664ee1.htm
---
# Autodesk.Revit.DB.SaveAsOptions

This class contains options available for saving a document to disk with a new filename.

## Syntax (C#)
```csharp
public class SaveAsOptions : IDisposable
```